---
type: ElementFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ElementFilter

`Autodesk.Revit.DB.ElementFilter` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | PassesFilter | — | `` |
| Property | Inverted | 2011 | `public bool Inverted { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |